_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, None, 64)          1280000   
_________________________________________________________________
gru_1 (GRU)                  (None, 64)                24768     
_________________________________________________________________
activation_1 (Activation)    (None, 64)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 64)                256       
_________________________________________________________________
dense_1 (Dense)              (None, 498)               32370     
=================================================================
Total params: 1,337,394
Trainable params: 1,337,266
Non-trainable params: 128
_________________________________________________________________
