_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, None, 256)         5120000   
_________________________________________________________________
gru_1 (GRU)                  (None, None, 256)         393984    
_________________________________________________________________
activation_1 (Activation)    (None, None, 256)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, None, 256)         0         
_________________________________________________________________
batch_normalization_1 (Batch (None, None, 256)         1024      
_________________________________________________________________
gru_2 (GRU)                  (None, 256)               393984    
_________________________________________________________________
activation_2 (Activation)    (None, 256)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 256)               1024      
_________________________________________________________________
dense_1 (Dense)              (None, 498)               127986    
=================================================================
Total params: 6,038,002
Trainable params: 6,036,978
Non-trainable params: 1,024
_________________________________________________________________
